mrodriguezme/tempest/src/mcu/mspm0/g/registers/gpio.h
// SPDX-License-Identifier: MIT
//
// Copyright 2026 Michael Rodriguez
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the “Software”), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED “AS IS”, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
// SOFTWARE.

#pragma once

#include <stdint.h>
#include "mcu_specific/features.h"
#include "mcu_specific/iomux.h"

// clang-format off

#ifdef MSPM0_HAS_GPIO0
#define GPIO0_BASE	(UINT32_C(0x400A0000))
#endif // MSPM0_HAS_GPIO0

#ifdef MSPM0_HAS_GPIO1
#define GPIO1_BASE	(UINT32_C(0x400A2000))
#endif // MSPM0_HAS_GPIO1

#define GPIO_PIN_PA31	(UINT32_C(1) << 31)
#define GPIO_PIN_PA30	(UINT32_C(1) << 30)
#define GPIO_PIN_PA29	(UINT32_C(1) << 29)
#define GPIO_PIN_PA28	(UINT32_C(1) << 28)
#define GPIO_PIN_PA27	(UINT32_C(1) << 27)
#define GPIO_PIN_PA26	(UINT32_C(1) << 26)
#define GPIO_PIN_PA25	(UINT32_C(1) << 25)
#define GPIO_PIN_PA24	(UINT32_C(1) << 24)
#define GPIO_PIN_PA23	(UINT32_C(1) << 23)
#define GPIO_PIN_PA22	(UINT32_C(1) << 22)
#define GPIO_PIN_PA21	(UINT32_C(1) << 21)
#define GPIO_PIN_PA20	(UINT32_C(1) << 20)
#define GPIO_PIN_PA19	(UINT32_C(1) << 19)
#define GPIO_PIN_PA18	(UINT32_C(1) << 18)
#define GPIO_PIN_PA17	(UINT32_C(1) << 17)
#define GPIO_PIN_PA16	(UINT32_C(1) << 16)
#define GPIO_PIN_PA15	(UINT32_C(1) << 15)
#define GPIO_PIN_PA14	(UINT32_C(1) << 14)
#define GPIO_PIN_PA13	(UINT32_C(1) << 13)
#define GPIO_PIN_PA12	(UINT32_C(1) << 12)
#define GPIO_PIN_PA11	(UINT32_C(1) << 11)
#define GPIO_PIN_PA10	(UINT32_C(1) << 10)
#define GPIO_PIN_PA9	(UINT32_C(1) << 9)
#define GPIO_PIN_PA8	(UINT32_C(1) << 8)
#define GPIO_PIN_PA7	(UINT32_C(1) << 7)
#define GPIO_PIN_PA6	(UINT32_C(1) << 6)
#define GPIO_PIN_PA5	(UINT32_C(1) << 5)
#define GPIO_PIN_PA4	(UINT32_C(1) << 4)
#define GPIO_PIN_PA3	(UINT32_C(1) << 3)
#define GPIO_PIN_PA2	(UINT32_C(1) << 2)
#define GPIO_PIN_PA1	(UINT32_C(1) << 1)
#define GPIO_PIN_PA0	(UINT32_C(1) << 0)

#define GPIO_REG_FSUB_0			(UINT32_C(0x400))
#define GPIO_REG_FSUB_1			(UINT32_C(0x404))
#define GPIO_REG_FPUB_0			(UINT32_C(0x444))
#define GPIO_REG_FPUB_1			(UINT32_C(0x448))
#define GPIO_REG_PWREN			(UINT32_C(0x800))
#define GPIO_REG_RSTCTL			(UINT32_C(0x804))
#define GPIO_REG_STAT			(UINT32_C(0x814))
#define GPIO_REG_CLKOVR			(UINT32_C(0x1010))
#define GPIO_REG_PDBGCTL		(UINT32_C(0x1018))
#define GPIO_REG_CPU_INT_IIDX		(UINT32_C(0x1020))
#define GPIO_REG_CPU_INT_IMASK		(UINT32_C(0x1028))
#define GPIO_REG_CPU_INT_RIS		(UINT32_C(0x1030))
#define GPIO_REG_CPU_INT_MIS		(UINT32_C(0x1038))
#define GPIO_REG_CPU_INT_ISET		(UINT32_C(0x1040))
#define GPIO_REG_CPU_INT_ICLR		(UINT32_C(0x1048))
#define GPIO_REG_GEN_EVENT0_IIDX	(UINT32_C(0x1050))
#define GPIO_REG_GEN_EVENT0_IMASK	(UINT32_C(0x1058))
#define GPIO_REG_GEN_EVENT0_RIS		(UINT32_C(0x1060))
#define GPIO_REG_GEN_EVENT0_MIS		(UINT32_C(0x1068))
#define GPIO_REG_GEN_EVENT0_ISET	(UINT32_C(0x1070))
#define GPIO_REG_GEN_EVENT0_ICLR	(UINT32_C(0x1078))
#define GPIO_REG_GEN_EVENT1_IIDX	(UINT32_C(0x1080))
#define GPIO_REG_GEN_EVENT1_IMASK	(UINT32_C(0x1088))
#define GPIO_REG_GEN_EVENT1_RIS		(UINT32_C(0x1090))
#define GPIO_REG_GEN_EVENT1_MIS		(UINT32_C(0x1098))
#define GPIO_REG_GEN_EVENT1_ISET	(UINT32_C(0x10A0))
#define GPIO_REG_GEN_EVENT1_ICLR	(UINT32_C(0x10A8))
#define GPIO_REG_EVT_MODE		(UINT32_C(0x10E0))
#define GPIO_REG_DESC			(UINT32_C(0x10FC))
#define GPIO_REG_DOUT3_0		(UINT32_C(0x1200))
#define GPIO_REG_DOUT7_4		(UINT32_C(0x1204))
#define GPIO_REG_DOUT11_8		(UINT32_C(0x1208))
#define GPIO_REG_DOUT15_12		(UINT32_C(0x120C))
#define GPIO_REG_DOUT19_16		(UINT32_C(0x1210))
#define GPIO_REG_DOUT23_20		(UINT32_C(0x1214))
#define GPIO_REG_DOUT27_24		(UINT32_C(0x1218))
#define GPIO_REG_DOUT31_28		(UINT32_C(0x121C))
#define GPIO_REG_DOUT31_0		(UINT32_C(0x1280))
#define GPIO_REG_DOUTSET31_0		(UINT32_C(0x1290))
#define GPIO_REG_DOUTCLR31_0		(UINT32_C(0x12A0))
#define GPIO_REG_DOUTTGL31_0		(UINT32_C(0x12B0))
#define GPIO_REG_DOE31_0		(UINT32_C(0x12C0))
#define GPIO_REG_DOESET31_0		(UINT32_C(0x12D0))
#define GPIO_REG_DOECLR31_0		(UINT32_C(0x12E0))
#define GPIO_REG_DIN3_0			(UINT32_C(0x1300))
#define GPIO_REG_DIN7_4			(UINT32_C(0x1304))
#define GPIO_REG_DIN11_8		(UINT32_C(0x1308))
#define GPIO_REG_DIN15_12		(UINT32_C(0x130C))
#define GPIO_REG_DIN19_16		(UINT32_C(0x1310))
#define GPIO_REG_DIN23_20		(UINT32_C(0x1314))
#define GPIO_REG_DIN27_24		(UINT32_C(0x1318))
#define GPIO_REG_DIN31_0		(UINT32_C(0x131C))
#define GPIO_REG_POLARITY15_0		(UINT32_C(0x1390))
#define GPIO_REG_POLARITY31_16		(UINT32_C(0x13A0))
#define GPIO_REG_CTL			(UINT32_C(0x1400))
#define GPIO_REG_FASTWAKE		(UINT32_C(0x1404))
#define GPIO_REG_SUB0CFG		(UINT32_C(0x1500))
#define GPIO_REG_FILTEREN15_0		(UINT32_C(0x1508))
#define GPIO_REG_FILTEREN31_16		(UINT32_C(0x150C))
#define GPIO_REG_DMAMASK		(UINT32_C(0x1510))
#define GPIO_REG_SUB1CFG		(UINT32_C(0x1520))

#define GPIO_REG_FSUB_0_CHANID_SHIFT	(UINT32_C(0))
#define GPIO_REG_FSUB_0_CHANID_MASK	(UINT32_C(0x0000000F))
#define GPIO_REG_FSUB_0_CHANID_MIN	(0)
#define GPIO_REG_FSUB_0_CHANID_ABS_MAX	(15)

#define GPIO_REG_FSUB_1_CHANID_SHIFT	(UINT32_C(0))
#define GPIO_REG_FSUB_1_CHANID_MASK	(UINT32_C(0x0000000F))
#define GPIO_REG_FSUB_1_CHANID_MIN	(0)
#define GPIO_REG_FSUB_1_CHANID_ABS_MAX	(15)

#define GPIO_REG_FPUB_0_CHANID_SHIFT	(UINT32_C(0))
#define GPIO_REG_FPUB_0_CHANID_MASK	(UINT32_C(0x0000000F))
#define GPIO_REG_FPUB_0_CHANID_MIN	(0)
#define GPIO_REG_FPUB_0_CHANID_ABS_MAX	(15)

#define GPIO_REG_FPUB_1_CHANID_SHIFT	(UINT32_C(0))
#define GPIO_REG_FPUB_1_CHANID_MASK	(UINT32_C(0x0000000F))
#define GPIO_REG_FPUB_1_CHANID_MIN	(0)
#define GPIO_REG_FPUB_1_CHANID_ABS_MAX	(15)

#define GPIO_REG_PWREN_KEY_SHIFT	(UINT32_C(24))
#define GPIO_REG_PWREN_KEY_MASK		(UINT32_C(0xFF000000))
#define GPIO_REG_PWREN_ENABLE_BIT	(UINT32_C(1) << 0)

#define GPIO_REG_PWREN_RSTCTL_KEY_SHIFT		(UINT32_C(24))
#define GPIO_REG_PWREN_RSTCTL_KEY_MASK		(UINT32_C(0xFF000000))
#define GPIO_REG_PWREN_RSTCTL_RESETSTKYCLR_BIT	(UINT32_C(1) << 1)
#define GPIO_REG_PWREN_RSTCTL_RESETASSERT_BIT	(UINT32_C(1) << 0)

#define GPIO_REG_STAT_RESETSTKY_BIT	(UINT32_C(1) << 16)

#define GPIO_REG_CLKOVR_RUN_STOP_BIT	(UINT32_C(1) << 1)
#define GPIO_REG_CLKOVR_OVERRIDE_BIT	(UINT32_C(1) << 0)

#define GPIO_REG_PDBGCTL_FREE_BIT	(UINT32_C(1) << 0)

#define GPIO_REG_CPU_INT_IIDX_STAT_SHIFT	(0)
#define GPIO_REG_CPU_INT_IIDX_STAT_MASK		(UINT32_C(0x000000FF))
#define GPIO_REG_CPU_INT_IIDX_STAT_NONE		(UINT32_C(0x0))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO0		(UINT32_C(0x1))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO1		(UINT32_C(0x2))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO2		(UINT32_C(0x3))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO3		(UINT32_C(0x4))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO4		(UINT32_C(0x5))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO5		(UINT32_C(0x6))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO6		(UINT32_C(0x7))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO7		(UINT32_C(0x8))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO8		(UINT32_C(0x9))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO9		(UINT32_C(0xA))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO10	(UINT32_C(0xB))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO11	(UINT32_C(0xC))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO12	(UINT32_C(0xD))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO13	(UINT32_C(0xE))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO14	(UINT32_C(0xF))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO15	(UINT32_C(0x10))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO16	(UINT32_C(0x11))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO17	(UINT32_C(0x12))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO18	(UINT32_C(0x13))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO19	(UINT32_C(0x14))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO20	(UINT32_C(0x15))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO21	(UINT32_C(0x16))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO22	(UINT32_C(0x17))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO23	(UINT32_C(0x18))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO24	(UINT32_C(0x19))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO25	(UINT32_C(0x1A))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO26	(UINT32_C(0x1B))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO27	(UINT32_C(0x1C))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO28	(UINT32_C(0x1D))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO29	(UINT32_C(0x1E))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO30	(UINT32_C(0x1F))
#define GPIO_REG_CPU_INT_IIDX_STAT_DIO31	(UINT32_C(0x20))

#define GPIO_REG_CPU_INT_IMASK_DIO31_BIT	(UINT32_C(1) << 31)
#define GPIO_REG_CPU_INT_IMASK_DIO30_BIT	(UINT32_C(1) << 30)
#define GPIO_REG_CPU_INT_IMASK_DIO29_BIT	(UINT32_C(1) << 29)
#define GPIO_REG_CPU_INT_IMASK_DIO28_BIT	(UINT32_C(1) << 28)
#define GPIO_REG_CPU_INT_IMASK_DIO27_BIT	(UINT32_C(1) << 27)
#define GPIO_REG_CPU_INT_IMASK_DIO26_BIT	(UINT32_C(1) << 26)
#define GPIO_REG_CPU_INT_IMASK_DIO25_BIT	(UINT32_C(1) << 25)
#define GPIO_REG_CPU_INT_IMASK_DIO24_BIT	(UINT32_C(1) << 24)
#define GPIO_REG_CPU_INT_IMASK_DIO23_BIT	(UINT32_C(1) << 23)
#define GPIO_REG_CPU_INT_IMASK_DIO22_BIT	(UINT32_C(1) << 22)
#define GPIO_REG_CPU_INT_IMASK_DIO21_BIT	(UINT32_C(1) << 21)
#define GPIO_REG_CPU_INT_IMASK_DIO20_BIT	(UINT32_C(1) << 20)
#define GPIO_REG_CPU_INT_IMASK_DIO19_BIT	(UINT32_C(1) << 19)
#define GPIO_REG_CPU_INT_IMASK_DIO18_BIT	(UINT32_C(1) << 18)
#define GPIO_REG_CPU_INT_IMASK_DIO17_BIT	(UINT32_C(1) << 17)
#define GPIO_REG_CPU_INT_IMASK_DIO16_BIT	(UINT32_C(1) << 16)
#define GPIO_REG_CPU_INT_IMASK_DIO15_BIT	(UINT32_C(1) << 15)
#define GPIO_REG_CPU_INT_IMASK_DIO14_BIT	(UINT32_C(1) << 14)
#define GPIO_REG_CPU_INT_IMASK_DIO13_BIT	(UINT32_C(1) << 13)
#define GPIO_REG_CPU_INT_IMASK_DIO12_BIT	(UINT32_C(1) << 12)
#define GPIO_REG_CPU_INT_IMASK_DIO11_BIT	(UINT32_C(1) << 11)
#define GPIO_REG_CPU_INT_IMASK_DIO10_BIT	(UINT32_C(1) << 10)
#define GPIO_REG_CPU_INT_IMASK_DIO9_BIT		(UINT32_C(1) << 9)
#define GPIO_REG_CPU_INT_IMASK_DIO8_BIT		(UINT32_C(1) << 8)
#define GPIO_REG_CPU_INT_IMASK_DIO7_BIT		(UINT32_C(1) << 7)
#define GPIO_REG_CPU_INT_IMASK_DIO6_BIT		(UINT32_C(1) << 6)
#define GPIO_REG_CPU_INT_IMASK_DIO5_BIT		(UINT32_C(1) << 5)
#define GPIO_REG_CPU_INT_IMASK_DIO4_BIT		(UINT32_C(1) << 4)
#define GPIO_REG_CPU_INT_IMASK_DIO3_BIT		(UINT32_C(1) << 3)
#define GPIO_REG_CPU_INT_IMASK_DIO2_BIT		(UINT32_C(1) << 2)
#define GPIO_REG_CPU_INT_IMASK_DIO1_BIT		(UINT32_C(1) << 1)
#define GPIO_REG_CPU_INT_IMASK_DIO0_BIT		(UINT32_C(1) << 0)

#define GPIO_REG_CPU_INT_IMASK_PA0_BIT		(GPIO_REG_CPU_INT_IMASK_DIO0)
#define GPIO_REG_CPU_INT_IMASK_PA1_BIT		(GPIO_REG_CPU_INT_IMASK_DIO1)
#define GPIO_REG_CPU_INT_IMASK_PA2_BIT		(GPIO_REG_CPU_INT_IMASK_DIO2)
#define GPIO_REG_CPU_INT_IMASK_PA3_BIT		(GPIO_REG_CPU_INT_IMASK_DIO3)
#define GPIO_REG_CPU_INT_IMASK_PA4_BIT		(GPIO_REG_CPU_INT_IMASK_DIO4)
#define GPIO_REG_CPU_INT_IMASK_PA5_BIT		(GPIO_REG_CPU_INT_IMASK_DIO5)
#define GPIO_REG_CPU_INT_IMASK_PA6_BIT		(GPIO_REG_CPU_INT_IMASK_DIO6)
#define GPIO_REG_CPU_INT_IMASK_PA7_BIT		(GPIO_REG_CPU_INT_IMASK_DIO7)
#define GPIO_REG_CPU_INT_IMASK_PA8_BIT		(GPIO_REG_CPU_INT_IMASK_DIO8)
#define GPIO_REG_CPU_INT_IMASK_PA9_BIT		(GPIO_REG_CPU_INT_IMASK_DIO9)
#define GPIO_REG_CPU_INT_IMASK_PA10_BIT		(GPIO_REG_CPU_INT_IMASK_DIO10)
#define GPIO_REG_CPU_INT_IMASK_PA11_BIT		(GPIO_REG_CPU_INT_IMASK_DIO11)
#define GPIO_REG_CPU_INT_IMASK_PA12_BIT		(GPIO_REG_CPU_INT_IMASK_DIO12)
#define GPIO_REG_CPU_INT_IMASK_PA13_BIT		(GPIO_REG_CPU_INT_IMASK_DIO13)
#define GPIO_REG_CPU_INT_IMASK_PA14_BIT		(GPIO_REG_CPU_INT_IMASK_DIO14)
#define GPIO_REG_CPU_INT_IMASK_PA15_BIT		(GPIO_REG_CPU_INT_IMASK_DIO15)
#define GPIO_REG_CPU_INT_IMASK_PA16_BIT		(GPIO_REG_CPU_INT_IMASK_DIO16)
#define GPIO_REG_CPU_INT_IMASK_PA17_BIT		(GPIO_REG_CPU_INT_IMASK_DIO17)
#define GPIO_REG_CPU_INT_IMASK_PA18_BIT		(GPIO_REG_CPU_INT_IMASK_DIO18)
#define GPIO_REG_CPU_INT_IMASK_PA19_BIT		(GPIO_REG_CPU_INT_IMASK_DIO19)
#define GPIO_REG_CPU_INT_IMASK_PA20_BIT		(GPIO_REG_CPU_INT_IMASK_DIO20)
#define GPIO_REG_CPU_INT_IMASK_PA21_BIT		(GPIO_REG_CPU_INT_IMASK_DIO21)
#define GPIO_REG_CPU_INT_IMASK_PA22_BIT		(GPIO_REG_CPU_INT_IMASK_DIO22)
#define GPIO_REG_CPU_INT_IMASK_PA23_BIT		(GPIO_REG_CPU_INT_IMASK_DIO23)
#define GPIO_REG_CPU_INT_IMASK_PA24_BIT		(GPIO_REG_CPU_INT_IMASK_DIO24)
#define GPIO_REG_CPU_INT_IMASK_PA25_BIT		(GPIO_REG_CPU_INT_IMASK_DIO25)
#define GPIO_REG_CPU_INT_IMASK_PA26_BIT		(GPIO_REG_CPU_INT_IMASK_DIO26)
#define GPIO_REG_CPU_INT_IMASK_PA27_BIT		(GPIO_REG_CPU_INT_IMASK_DIO27)
#define GPIO_REG_CPU_INT_IMASK_PA28_BIT		(GPIO_REG_CPU_INT_IMASK_DIO28)
#define GPIO_REG_CPU_INT_IMASK_PA29_BIT		(GPIO_REG_CPU_INT_IMASK_DIO29)
#define GPIO_REG_CPU_INT_IMASK_PA30_BIT		(GPIO_REG_CPU_INT_IMASK_DIO30)
#define GPIO_REG_CPU_INT_IMASK_PA31_BIT		(GPIO_REG_CPU_INT_IMASK_DIO31)
#define GPIO_REG_CPU_INT_IMASK_PB0_BIT		(GPIO_REG_CPU_INT_IMASK_DIO0)
#define GPIO_REG_CPU_INT_IMASK_PB1_BIT		(GPIO_REG_CPU_INT_IMASK_DIO1)
#define GPIO_REG_CPU_INT_IMASK_PB2_BIT		(GPIO_REG_CPU_INT_IMASK_DIO2)
#define GPIO_REG_CPU_INT_IMASK_PB3_BIT		(GPIO_REG_CPU_INT_IMASK_DIO3)
#define GPIO_REG_CPU_INT_IMASK_PB4_BIT		(GPIO_REG_CPU_INT_IMASK_DIO4)
#define GPIO_REG_CPU_INT_IMASK_PB5_BIT		(GPIO_REG_CPU_INT_IMASK_DIO5)
#define GPIO_REG_CPU_INT_IMASK_PB6_BIT		(GPIO_REG_CPU_INT_IMASK_DIO6)
#define GPIO_REG_CPU_INT_IMASK_PB7_BIT		(GPIO_REG_CPU_INT_IMASK_DIO7)
#define GPIO_REG_CPU_INT_IMASK_PB8_BIT		(GPIO_REG_CPU_INT_IMASK_DIO8)
#define GPIO_REG_CPU_INT_IMASK_PB9_BIT		(GPIO_REG_CPU_INT_IMASK_DIO9)
#define GPIO_REG_CPU_INT_IMASK_PB10_BIT		(GPIO_REG_CPU_INT_IMASK_DIO10)
#define GPIO_REG_CPU_INT_IMASK_PB11_BIT		(GPIO_REG_CPU_INT_IMASK_DIO11)
#define GPIO_REG_CPU_INT_IMASK_PB12_BIT		(GPIO_REG_CPU_INT_IMASK_DIO12)
#define GPIO_REG_CPU_INT_IMASK_PB13_BIT		(GPIO_REG_CPU_INT_IMASK_DIO13)
#define GPIO_REG_CPU_INT_IMASK_PB14_BIT		(GPIO_REG_CPU_INT_IMASK_DIO14)
#define GPIO_REG_CPU_INT_IMASK_PB15_BIT		(GPIO_REG_CPU_INT_IMASK_DIO15)
#define GPIO_REG_CPU_INT_IMASK_PB16_BIT		(GPIO_REG_CPU_INT_IMASK_DIO16)
#define GPIO_REG_CPU_INT_IMASK_PB17_BIT		(GPIO_REG_CPU_INT_IMASK_DIO17)
#define GPIO_REG_CPU_INT_IMASK_PB18_BIT		(GPIO_REG_CPU_INT_IMASK_DIO18)
#define GPIO_REG_CPU_INT_IMASK_PB19_BIT		(GPIO_REG_CPU_INT_IMASK_DIO19)
#define GPIO_REG_CPU_INT_IMASK_PB20_BIT		(GPIO_REG_CPU_INT_IMASK_DIO20)
#define GPIO_REG_CPU_INT_IMASK_PB21_BIT		(GPIO_REG_CPU_INT_IMASK_DIO21)
#define GPIO_REG_CPU_INT_IMASK_PB22_BIT		(GPIO_REG_CPU_INT_IMASK_DIO22)
#define GPIO_REG_CPU_INT_IMASK_PB23_BIT		(GPIO_REG_CPU_INT_IMASK_DIO23)
#define GPIO_REG_CPU_INT_IMASK_PB24_BIT		(GPIO_REG_CPU_INT_IMASK_DIO24)
#define GPIO_REG_CPU_INT_IMASK_PB25_BIT		(GPIO_REG_CPU_INT_IMASK_DIO25)
#define GPIO_REG_CPU_INT_IMASK_PB26_BIT		(GPIO_REG_CPU_INT_IMASK_DIO26)
#define GPIO_REG_CPU_INT_IMASK_PB27_BIT		(GPIO_REG_CPU_INT_IMASK_DIO27)

// clang-format on
